import type { PageLoad } from './$types';

const questions = [
    {
        sankazei: "のじゃじゃ",
        message: "下に行けば行くほど参加勢の誰か予想しやすいサジェストになっていきます！",
        keywords: [
            "かわいい",
            "トーマス",
            "Among us",
            "サッカー",
            "家出",
            "死神",
            "倫理観"
        ]
    },
    {
        sankazei: "やち",
        message: "下に行けば行くほど参加勢の誰か予想しやすいサジェストになっていきます！",
        keywords: [
            "でぽん",
            "Amoung us",
            "わど",
            "シンガポール",
            "ぽりたん",
            "就職",
            "顔",
            "デパス"
        ]
    },
    {
        sankazei: "インキャ転生",
        message: "下に行けば行くほど参加勢の誰か予想しやすいサジェストになっていきます！",
        keywords: [
            "病気",
            "ドッキリ",
            "料理",
            "ひまじん",
            "実写",
            "ジョジョ",
            "ひまじん",
            "俺が一番がいいのに"
        ]
    },
    {
        sankazei: "こうたん",
        message: "先に答えを見て、サジェストを予想しても面白いと思います！",
        keywords: [
            "酔っ払い",
            "酒",
            "弟",
            "scp",
            "いもむし",
            "実写",
            "N高"
        ]
    },
    {
        sankazei: "あーけん",
        message: "先に答えを見て、サジェストを予想しても面白いと思います！",
        keywords: [
            "かわいい",
            "泣く",
            "トーマス",
            "この",
            "聖書朗読",
            "みんな不幸になれ",
        ]
    },
    {
        sankazei: "なっしー",
        message: "先に答えを見て、サジェストを予想しても面白いと思います！",
        keywords: [
            "実写",
            "病院",
            "パチンコ",
            "Among us",
            "マリカ",
            "この",
            "ストーカー",
        ]
    },
    {
        sankazei: "ごりらび",
        message: "先に答えを見て、サジェストを予想しても面白いと思います！",
        keywords: [
            "建築",
            "彼女",
            "結婚",
            "泥酔",
            "つまびらか"
        ]
    },
    {
        sankazei: "わどるど",
        message: "先に答えを見て、サジェストを予想しても面白いと思います！",
        keywords: [
            "精通",
            "声",
            "かわいい",
            "選手権",
            "こうたん",
            "やち 何があった",
        ]
    },
    {
        sankazei: "ぺにがき",
        message: "先に答えを見て、サジェストを予想しても面白いと思います！",
        keywords: [
            "かわいい",
            "ドレハン",
            "誕生日",
            "サッカー",
            "算数",
            "年齢",
            "声変わり",
        ]
    },
    {
        sankazei: "ヘルスカ",
        message: "先に答えを見て、サジェストを予想しても面白いと思います！",
        keywords: [
            "マイクラ",
            "BAN",
            "立ち絵",
            "創価学会",
            "国歌",
            "Among us",
            "来日",
            "フィンランド語",
        ]
    },
    {
        sankazei: "できおこ",
        message: "先に答えを見て、サジェストを予想しても面白いと思います！",
        keywords: [
            "面白い",
            "うみにゃ",
            "顔",
            "Among us",
            "復活",
            "財布",
            "めっちゃ偉い",
        ]
    },
    {
        sankazei: "あっしー",
        message: "この問題がラスト！次はおまけです！",
        keywords: [
            "声",
            "Apex",
            "難病",
            "2ダウン",
            "声真似",
            "しゃーないしゃーない",
        ]
    },
]

export const load: PageLoad = ({ params }) => {
    let num = Number(params.questionNum)
    let question = questions[num - 1]
    
    return {
        num,
        question
    };
};